# PANDAS DATAFRAMES
- Data Structures: Dataframes and Series
- Pandas Data-frame - 2 Dimensional heterogenous data-structure (each column is aloud to have a different data-type) 
- Pandas Series - 1 D heterogeneous data structure - Each row / column in a table / dataframe is a pandas series.
- Pandas library is built over numpy arrays, so all the functions of numpy arrays are also applicable on pandas dataframes, once it is in the numeric format

In [1]:
import pandas as pd

In [2]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [3]:
brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [4]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [5]:
type(brics)

pandas.core.frame.DataFrame

In [6]:
brics.shape

(5, 4)

In [7]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
brics.index = ["A", "B", "C", "D", "E"]

In [9]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [10]:
brics.index = range(1,10,2)

In [11]:
brics

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [12]:
brics.columns #retrieves the column names

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [19]:
c = brics.country #column series

In [20]:
type(c)

pandas.core.series.Series

In [23]:
c.dtype

dtype('O')

In [16]:
brics.capital

0     Brasilia
1       Moscow
2    New Delhi
3      Beijing
4     Pretoria
Name: capital, dtype: object

In [31]:
brics['capital']

1     Brasilia
3       Moscow
5    New Delhi
7      Beijing
9     Pretoria
Name: capital, dtype: object

In [17]:
brics.area

0     8.516
1    17.100
2     3.286
3     9.670
4     2.980
Name: area, dtype: float64

In [32]:
brics['area']

1     8.516
3    17.100
5     3.286
7     9.670
9     2.980
Name: area, dtype: float64

In [24]:
p = brics.population

In [25]:
p.dtype

dtype('float64')

In [33]:
p = brics["population"]

In [35]:
type(p)

pandas.core.series.Series

In [36]:
brics.index

RangeIndex(start=1, stop=10, step=2)

In [37]:
brics

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [38]:
brics.set_index("country")

                capital    area  population
country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [39]:
brics

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [40]:
brics = brics.set_index("country")

In [41]:
brics

                capital    area  population
country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [43]:
brics.reset_index(inplace = True) #inplace = T will make the changes inplace in the brics variable

In [44]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [45]:
brics = brics.set_index("country")

                capital    area  population
country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [49]:
brics.set_index("capital", inplace = True)
#inplace = T will make the changes inplace and returns a null value, so please make sure that you are not doing the assignment to var brics along with inplace argument

In [51]:
brics = brics.set_index("area", inplace = True)

In [52]:
brics #null is being returned

In [53]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [54]:
brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [55]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [56]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [58]:
brics.index[3] = "China"

TypeError: Index does not support mutable operations

In [59]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [60]:
brics.columns = range(len(brics.columns))

In [61]:
brics

              0          1       2       3
0        Brazil   Brasilia   8.516   200.4
1        Russia     Moscow  17.100   143.5
2         India  New Delhi   3.286  1252.0
3         China    Beijing   9.670   133.0
4  South Africa   Pretoria   2.980     4.3

In [63]:
brics.columns[1] = "Capital"

TypeError: Index does not support mutable operations

In [65]:
type(brics.columns)

pandas.core.indexes.range.RangeIndex

In [66]:
b = list(brics.columns)

In [67]:
b[1] = "Capital"

In [69]:
brics.columns = b

In [70]:
brics

              0    Capital       2       3
0        Brazil   Brasilia   8.516   200.4
1        Russia     Moscow  17.100   143.5
2         India  New Delhi   3.286  1252.0
3         China    Beijing   9.670   133.0
4  South Africa   Pretoria   2.980     4.3

In [71]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [72]:
brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [73]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [75]:
b=brics.rename(columns={'country': 'count', 'area': 'ar'})

In [76]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [77]:
b

          count    capital      ar  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [80]:
a=b.rename(index={2: "India", 4: "SA"})

In [81]:
a

              count    capital      ar  population
0            Brazil   Brasilia   8.516       200.4
1            Russia     Moscow  17.100       143.5
India         India  New Delhi   3.286      1252.0
3             China    Beijing   9.670       133.0
SA     South Africa   Pretoria   2.980         4.3

In [82]:
a.rename(mapper = str.upper, axis = 1) #axis = 1 is for columns and axis = 0 is for rows

              COUNT    CAPITAL      AR  POPULATION
0            Brazil   Brasilia   8.516       200.4
1            Russia     Moscow  17.100       143.5
India         India  New Delhi   3.286      1252.0
3             China    Beijing   9.670       133.0
SA     South Africa   Pretoria   2.980         4.3

In [83]:
b

          count    capital      ar  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [86]:
b.rename(mapper = lambda x: x**2, axis = 0, inplace = True)

In [87]:
b

           count    capital      ar  population
0         Brazil   Brasilia   8.516       200.4
1         Russia     Moscow  17.100       143.5
4          India  New Delhi   3.286      1252.0
9          China    Beijing   9.670       133.0
16  South Africa   Pretoria   2.980         4.3

In [ ]:
#rename - is a fn applicable only for row names and column names

In [90]:
b.reset_index(inplace = True)

In [91]:
b

   index         count    capital      ar  population
0      0        Brazil   Brasilia   8.516       200.4
1      1        Russia     Moscow  17.100       143.5
2      4         India  New Delhi   3.286      1252.0
3      9         China    Beijing   9.670       133.0
4     16  South Africa   Pretoria   2.980         4.3

In [93]:
b.drop(labels = ["index"], axis = 1, inplace = True)

In [94]:
b

          count    capital      ar  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [98]:
b.set_index("count", inplace=True)

In [99]:
b

                capital      ar  population
count
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [101]:
b.reset_index(inplace = True)

In [104]:
b = b.reset_index(drop = True)

In [105]:
b

          count    capital      ar  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

### Import the csv files and excel files

In [106]:
pwd() #present working directory

'C:\\Users\\Vaibhav\\Desktop\\2nd_Dec_Batch'

In [107]:
import os

In [108]:
os.chdir(r"C:\Users\Vaibhav\Desktop\BA\Datasets") #to change the working dir

In [109]:
pwd()

'C:\\Users\\Vaibhav\\Desktop\\BA\\Datasets'

In [111]:
os.chdir("C:\\Users\\Vaibhav\\Desktop\\2nd_Dec_Batch")

In [112]:
pwd()

'C:\\Users\\Vaibhav\\Desktop\\2nd_Dec_Batch'

In [13]:
titanic = pd.read_csv("titanic_train.csv") #if the file is there in the working dir, then you need not specify the complete path
#But if you want to read the file from a folder outside the directory, then we have to specify the complete path

In [14]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [115]:
type(titanic)

pandas.core.frame.DataFrame

In [116]:
var = pd.read_csv("boston.csv")

FileNotFoundError: [Errno 2] File b'boston.csv' does not exist: b'boston.csv'

In [117]:
var = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\boston.csv")
#because boston.csv wasn't there in the working directory

In [118]:
var

,CRIM,ZN,INDUS,CHAS,NX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
5,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222.0,18.7,394.12,5.21,28.7
6,0.08829,12.5,7.87,0,0.524,6.012,66.6,5.5605,5,311.0,15.2,395.60,12.43,22.9
7,0.14455,12.5,7.87,0,0.524,6.172,96.1,5.9505,5,311.0,15.2,396.90,19.15,27.1
8,0.21124,12.5,7.87,0,0.524,5.631,100.0,6.0821,5,311.0,15.2,386.63,29.93,16.5
9,0.17004,12.5,7.87,0,0.524,6.004,85.9,6.5921,5,311.0,15.2,386.71,17.10,18.9
10,0.22489,12.5,7.87,0,0.524,6.377,94.3,6.3467,5,311.0,15.2,392.52,20.45,15.0
11,0.11747,12.5,7.87,0,0.524,6.009,82.9,6.2267,5,311.0,15.2,396.90,13.27,18.9
12,0.09378,12.5,7.87,0,0.524,5.889,39.0,5.4509,5,311.0,15.2,390.50,15.71,21.7
13,0.62976,0.0,8.14,0,0.538,5.949,61.8,4.7075,4,307.0,21.0,396.90,8.26,20.4
14,0.63796,0.0,8.14,0,0.538,6.096,84.5,4.4619,4,307.0,21.0,380.02,10.26,18.2
15,0.62739,0.0,8.14,0,0.538,5.834,56.5,4.4986,4,307.0,21.0,395.62,8.47,19.9
16,1.05393,0.0,8.14,0,0.538,5.935,29.3,4.4986,4,307.0,21.0,386.85,6.58,23.1
17,0.78420,0.0,8.14,0,0.538,5.990,81.7,4.2579,4,307.0,21.0,386.75,14.67,17.5
18,0.80271,0.0,8.14,0,0.538,5.456,36.6,3.7965,4,307.0,21.0,288.99,11.69,20.2
19,0.72580,0.0,8.14,0,0.538,5.727,69.5,3.7965,4,307.0,21.0,390.95,11.28,18.2
20,1.25179,0.0,8.14,0,0.538,5.570,98.1,3.7979,4,307.0,21.0,376.57,21.02,13.6
21,0.85204,0.0,8.14,0,0.538,5.965,89.2,4.0123,4,307.0,21.0,392.53,13.83,19.6
22,1.23247,0.0,8.14,0,0.538,6.142,91.7,3.9769,4,307.0,21.0,396.90,18.72,15.2
23,0.98843,0.0,8.14,0,0.538,5.813,100.0,4.0952,4,307.0,21.0,394.54,19.88,14.5
24,0.75026,0.0,8.14,0,0.538,5.924,94.1,4.3996,4,307.0,21.0,394.33,16.30,15.6
25,0.84054,0.0,8.14,0,0.538,5.599,85.7,4.4546,4,307.0,21.0,303.42,16.51,13.9
26,0.67191,0.0,8.14,0,0.538,5.813,90.3,4.6820,4,307.0,21.0,376.88,14.81,16.6
27,0.95577,0.0,8.14,0,0.538,6.047,88.8,4.4534,4,307.0,21.0,306.38,17.28,14.8
28,0.77299,0.0,8.14,0,0.538,6.495,94.4,4.4547,4,307.0,21.0,387.94,12.80,18.4
29,1.00245,0.0,8.14,0,0.538,6.674,87.3,4.2390,4,307.0,21.0,380.23,11.98,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
476,4.87141,0.0,18.10,0,0.614,6.484,93.6,2.3053,24,666.0,20.2,396.21,18.68,16.7
477,15.02340,0.0,18.10,0,0.614,5.304,97.3,2.1007,24,666.0,20.2,349.48,24.91,12.0
478,10.23300,0.0,18.10,0,0.614,6.185,96.7,2.1705,24,666.0,20.2,379.70,18.03,14.6
479,14.33370,0.0,18.10,0,0.614,6.229,88.0,1.9512,24,666.0,20.2,383.32,13.11,21.4
480,5.82401,0.0,18.10,0,0.532,6.242,64.7,3.4242,24,666.0,20.2,396.90,10.74,23.0
481,5.70818,0.0,18.10,0,0.532,6.750,74.9,3.3317,24,666.0,20.2,393.07,7.74,23.7
482,5.73116,0.0,18.10,0,0.532,7.061,77.0,3.4106,24,666.0,20.2,395.28,7.01,25.0
483,2.81838,0.0,18.10,0,0.532,5.762,40.3,4.0983,24,666.0,20.2,392.92,10.42,21.8
484,2.37857,0.0,18.10,0,0.583,5.871,41.9,3.7240,24,666.0,20.2,370.73,13.34,20.6
485,3.67367,0.0,18.10,0,0.583,6.312,51.9,3.9917,24,666.0,20.2,388.62,10.58,21.2
486,5.69175,0.0,18.10,0,0.583,6.114,79.8,3.5459,24,666.0,20.2,392.68,14.98,19.1
487,4.83567,0.0,18.10,0,0.583,5.905,53.2,3.1523,24,666.0,20.2,388.22,11.45,20.6
488,0.15086,0.0,27.74,0,0.609,5.454,92.7,1.8209,4,711.0,20.1,395.09,18.06,15.2
489,0.18337,0.0,27.74,0,0.609,5.414,98.3,1.7554,4,711.0,20.1,344.05,23.97,7.0
490,0.20746,0.0,27.74,0,0.609,5.093,98.0,1.8226,4,711.0,20.1,318.43,29.68,8.1
491,0.10574,0.0,27.74,0,0.609,5.983,98.8,1.8681,4,711.0,20.1,390.11,18.07,13.6
492,0.11132,0.0,27.74,0,0.609,5.983,83.5,2.1099,4,711.0,20.1,396.90,13.35,20.1
493,0.17331,0.0,9.69,0,0.585,5.707,54.0,2.3817,6,391.0,19.2,396.90,12.01,21.8
494,0.27957,0.0,9.69,0,0.585,5.926,42.6,2.3817,6,391.0,19.2,396.90,13.59,24.5
495,0.17899,0.0,9.69,0,0.585,5.670,28.8,2.7986,6,391.0,19.2,393.29,17.60,23.1
496,0.28960,0.0,9.69,0,0.585,5.390,72.9,2.7986,6,391.0,19.2,396.90,21.14,19.7
497,0.26838,0.0,9.69,0,0.585,5.794,70.6,2.8927,6,391.0,19.2,396.90,14.10,18.3
498,0.23912,0.0,9.69,0,0.585,6.019,65.3,2.4091,6,391.0,19.2,396.90,12.92,21.2
499,0.17783,0.0,9.69,0,0.585,5.569,73.5,2.3999,6,391.0,19.2,395.77,15.10,17.5
500,0.22438,0.0,9.69,0,0.585,6.027,79.7,2.4982,6,391.0,19.2,396.90,14.33,16.8
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

# Class 7

In [1]:
import pandas as pd

In [2]:
pwd()

'C:\\Users\\Vaibhav\\Desktop\\2nd_Dec_Batch'

In [13]:
titanic_mod = pd.read_excel("titanic_modified_NA.xlsx", header=None, names = titanic.columns, index_col="PassengerId", 
                            na_values=["T", "?"])

In [15]:
titanic_mod.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,NaN

In [22]:
titanic_mod = pd.read_excel("titanic_modified_NA.xlsx", header=None, names = titanic.columns, index_col="PassengerId", 
                            na_values={"Survived": "?", 
                                       "Embarked": ["T", "S"], 
                                       "Cabin": "C85",
                                       "Ticket": "A/5 21171"})

In [13]:
titanic_mod = pd.read_excel("titanic_modified_NA.xlsx", header=None, names = titanic.columns, index_col="PassengerId", 
                            na_values=["T", "?"])

In [15]:
titanic_mod.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,NaN

In [23]:
titanic_mod.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,NaN,7.2500,NaN,NaN
2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,NaN,C
3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,NaN
4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,NaN
5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,NaN

In [24]:
titanic_mod = pd.read_excel("titanic_modified_NA.xlsx", header=None, names = titanic.columns, index_col="PassengerId", 
                            na_values=["T", "?"], sheet_name=0)

In [13]:
titanic_mod = pd.read_excel("titanic_modified_NA.xlsx", header=None, names = titanic.columns, index_col="PassengerId", 
                            na_values=["T", "?"])

In [25]:
titanic_mod.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,NaN

In [34]:
list(range(2))

[0, 1]

In [38]:
titanic_mod = pd.read_excel("titanic_modified_NA.xlsx", na_values=["T", "?"], sheet_name=list(range(2)))
#it will be read as a dictionary with key 0 having the value of the 1st sheet
#key 1 having the value of the 2nd sheet

In [39]:
titanic_mod[0].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,NaN

In [40]:
titanic_mod[1]

   ID  Employee ID   Employee Name  Phone Number
0   1         2422  Samridhi Dutta    8867308477

In [41]:
from sklearn import datasets

In [44]:
iris = datasets.load_iris()

In [46]:
type(iris)

sklearn.utils.Bunch

In [60]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [48]:
X = iris.data

In [49]:
X.shape

(150, 4)

In [50]:
iris.DESCR

'.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...'

In [51]:
iris.feature_names

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [61]:
X = pd.DataFrame(iris.data, columns=iris.feature_names)

In [62]:
X.head() #head always displays the top 5 rows

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [ ]:
X.tail() #tail fn of pandas df displays the bottom 5 rows

In [63]:
X.shape

(150, 4)

In [64]:
y = iris.target

In [65]:
y

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [66]:
y.shape #1-d array

(150,)

In [67]:
X.shape #2-d array

(150, 4)

In [72]:
import numpy as np
y = y.reshape((-1,1))

In [73]:
y.shape

(150, 1)

In [75]:
ir = np.concatenate((y, iris.data), axis = 1) #axis = 1 means column wise concatenation
#axis = 0 means row-wise concatenation of arrays

In [76]:
ir.shape

(150, 5)

In [78]:
iris.feature_names

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [80]:
df=pd.DataFrame(ir, columns=["Species"] + iris.feature_names)

In [85]:
iris.target

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

----

In [87]:
b = datasets.load_boston()

In [88]:
b.data # independent vars / features

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
        4.9800e+00],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
        9.1400e+00],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
        4.0300e+00],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
        5.6400e+00],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
        6.4800e+00],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
        7.8800e+00]])

In [89]:
b.target #the values of the response / target var

array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
       18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
       15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
       13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
       21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
       35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
       19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
       20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
       23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
       33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
       21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
       20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
       23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
       15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
       17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
       25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
       23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
       32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
       34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
       20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
       26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
       31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
       22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
       42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
       36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
       32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
       20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
       20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
       22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
       21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
       19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
       32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
       18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
       16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
       13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
        7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
       12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
       27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
        8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
        9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
       10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
       15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
       19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
       29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
       20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
       23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9])

In [90]:
b.DESCR

".. _boston_dataset:\n\nBoston house prices dataset\n---------------------------\n\n**Data Set Characteristics:**  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive. Median Value (attribute 14) is usually the target.\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/housing/\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n.. topic:: References\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n"

In [91]:
b.feature_names #names of the features / X vars

array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7')

In [92]:
b.filename

'C:\\Users\\Vaibhav\\Anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\boston_house_prices.csv'

In [95]:
bos_arr=np.concatenate((b.target.reshape(-1,1), b.data), axis = 1)

In [100]:
cn = ["MEDV"]+list(b.feature_names)

In [102]:
boston=pd.DataFrame(bos_arr, columns=cn)

In [103]:
boston.head()

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,33.4,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,36.2,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33

In [ ]:
#try your hands to load this - datasets.load_breast_cancer

----

In [104]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [105]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [108]:
titanic.Survived=titanic['Survived'].astype(np.bool)

In [109]:
titanic.dtypes

PassengerId      int64
Survived          bool
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [114]:
titanic.Embarked=titanic['Embarked'].astype("category")

In [ ]:
#dtypes in pandas series
#object - for character columns
#category - for categorical columns
#int
#float
#bool

## Subsetting and slicing of datasets

In [117]:
boston[0:2]

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.9,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.9,9.14

In [118]:
boston[0] #integer indexing not supported

KeyError: 0

In [120]:
boston.MEDV[:3] #MEDV column - it's a pandas series

0    24.0
1    21.6
2    34.7
Name: MEDV, dtype: float64

In [122]:
boston["MEDV"][:3]

0    24.0
1    21.6
2    34.7
Name: MEDV, dtype: float64

In [123]:
boston.columns

Index(['MEDV', 'CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'],
      dtype='object')

In [125]:
boston[["MEDV", "CRIM", "INDUS", "PTRATIO"]][:3]

   MEDV     CRIM  INDUS  PTRATIO
0  24.0  0.00632   2.31     15.3
1  21.6  0.02731   7.07     17.8
2  34.7  0.02729   7.07     17.8

In [127]:
boston[["MEDV"]][:3]

   MEDV
0  24.0
1  21.6
2  34.7

In [131]:
boston[2::50]

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
52,25.0,0.05360,21.0,5.64,0.0,0.439,6.511,21.1,6.8147,4.0,243.0,16.8,396.90,5.28
102,18.6,0.22876,0.0,8.56,0.0,0.520,6.405,85.4,2.7147,5.0,384.0,20.9,70.80,10.63
152,15.3,1.12658,0.0,19.58,1.0,0.871,5.012,88.0,1.6102,5.0,403.0,14.7,343.28,12.12
202,42.3,0.02177,82.5,2.03,0.0,0.415,7.610,15.7,6.2700,2.0,348.0,14.7,395.38,3.11
252,29.6,0.08221,22.0,5.86,0.0,0.431,6.957,6.8,8.9067,7.0,330.0,19.1,386.09,3.53
302,26.4,0.09266,34.0,6.09,0.0,0.433,6.495,18.4,5.4917,7.0,329.0,16.1,383.61,8.67
352,18.6,0.07244,60.0,1.69,0.0,0.411,5.884,18.5,10.7103,4.0,411.0,18.3,392.33,7.79
402,12.1,9.59571,0.0,18.10,0.0,0.693,6.404,100.0,1.6390,24.0,666.0,20.2,376.11,20.31
452,16.1,5.09017,0.0,18.10,0.0,0.713,6.297,91.8,2.3682,24.0,666.0,20.2,385.09,17.27
502,20.6,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08

In [132]:
boston[0] #integer indexing not supported

KeyError: 0

----

In [133]:
boston.MEDV[0]

24.0

In [134]:
boston.MEDV[:5]

0    24.0
1    21.6
2    34.7
3    33.4
4    36.2
Name: MEDV, dtype: float64

----

### iloc fn

In [139]:
#to get the 0th row - so it's a pandas series
boston.iloc[0]

MEDV        24.00000
CRIM         0.00632
ZN          18.00000
INDUS        2.31000
CHAS         0.00000
NOX          0.53800
RM           6.57500
AGE         65.20000
DIS          4.09000
RAD          1.00000
TAX        296.00000
PTRATIO     15.30000
B          396.90000
LSTAT        4.98000
Name: 0, dtype: float64

In [140]:
boston.iloc[0, 0] #0th row and the 0th col

24.0

In [141]:
boston.iloc[:2, [5,6]]

     NOX     RM
0  0.538  6.575
1  0.469  6.421

In [142]:
boston.iloc[[2,3,7], ::-1]

,LSTAT,B,PTRATIO,TAX,RAD,DIS,AGE,RM,NOX,CHAS,INDUS,ZN,CRIM,MEDV
2,4.03,392.83,17.8,242.0,2.0,4.9671,61.1,7.185,0.469,0.0,7.07,0.0,0.02729,34.7
3,2.94,394.63,18.7,222.0,3.0,6.0622,45.8,6.998,0.458,0.0,2.18,0.0,0.03237,33.4
7,19.15,396.90,15.2,311.0,5.0,5.9505,96.1,6.172,0.524,0.0,7.87,12.5,0.14455,27.1

----

### loc fn - for subsetting by row index and column names

In [143]:
boston[:4]

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,33.4,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94

In [144]:
boston.loc[3, "CRIM"]

0.03237

In [145]:
boston.loc[:4, "CRIM": "TAX"]

      CRIM    ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD    TAX
0  0.00632  18.0   2.31   0.0  0.538  6.575  65.2  4.0900  1.0  296.0
1  0.02731   0.0   7.07   0.0  0.469  6.421  78.9  4.9671  2.0  242.0
2  0.02729   0.0   7.07   0.0  0.469  7.185  61.1  4.9671  2.0  242.0
3  0.03237   0.0   2.18   0.0  0.458  6.998  45.8  6.0622  3.0  222.0
4  0.06905   0.0   2.18   0.0  0.458  7.147  54.2  6.0622  3.0  222.0

In [147]:
titanic.set_index("Name", inplace=True)

In [148]:
titanic.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,False,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,True,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,True,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,True,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,False,3,male,35.0,0,0,373450,8.0500,NaN,S

In [149]:
titanic.iloc[0,:]

PassengerId            1
Survived           False
Pclass                 3
Sex                 male
Age                   22
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [150]:
titanic.loc["Braund, Mr. Owen Harris", :]

PassengerId            1
Survived           False
Pclass                 3
Sex                 male
Age                   22
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [151]:
titanic.loc["Cumings, Mrs. John Bradley (Florence Briggs Thayer)":"Allen, Mr. William Henry":2 , :]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,True,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,True,1,female,35.0,1,0,113803,53.1000,C123,S

In [154]:
boston.loc[[3,5,8], "LSTAT":"ZN": -1]

,LSTAT,B,PTRATIO,TAX,RAD,DIS,AGE,RM,NOX,CHAS,INDUS,ZN
3,2.94,394.63,18.7,222.0,3.0,6.0622,45.8,6.998,0.458,0.0,2.18,0.0
5,5.21,394.12,18.7,222.0,3.0,6.0622,58.7,6.430,0.458,0.0,2.18,0.0
8,29.93,386.63,15.2,311.0,5.0,6.0821,100.0,5.631,0.524,0.0,7.87,12.5

In [155]:
boston.loc[[3,5,8], ["LSTAT","ZN"]]

   LSTAT    ZN
3   2.94   0.0
5   5.21   0.0
8  29.93  12.5

In [156]:
boston.loc[[3,4,10], "LSTAT"] #i retreive a series

3      2.94
4      5.33
10    20.45
Name: LSTAT, dtype: float64

In [157]:
boston.loc[[3,4,10], ["LSTAT"]] #retreives a df

    LSTAT
3    2.94
4    5.33
10  20.45

----

### Boolean Indexing

In [158]:
boston.head()

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,33.4,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,36.2,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33

In [165]:
boston[boston.AGE>99.9]["AGE"]

8      100.0
23     100.0
31     100.0
141    100.0
142    100.0
143    100.0
145    100.0
146    100.0
151    100.0
158    100.0
159    100.0
209    100.0
258    100.0
259    100.0
367    100.0
368    100.0
371    100.0
373    100.0
374    100.0
379    100.0
382    100.0
383    100.0
386    100.0
388    100.0
398    100.0
400    100.0
401    100.0
402    100.0
405    100.0
406    100.0
407    100.0
409    100.0
410    100.0
411    100.0
412    100.0
413    100.0
414    100.0
415    100.0
418    100.0
420    100.0
437    100.0
442    100.0
443    100.0
Name: AGE, dtype: float64

In [171]:
boston[boston.AGE<7]

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
41,26.6,0.12744,0.0,6.91,0.0,0.448,6.770,2.9,5.7209,3.0,233.0,17.9,385.41,4.84
42,25.3,0.14150,0.0,6.91,0.0,0.448,6.169,6.6,5.7209,3.0,233.0,17.9,383.37,5.81
43,24.7,0.15936,0.0,6.91,0.0,0.448,6.211,6.5,5.7209,3.0,233.0,17.9,394.46,7.44
70,24.2,0.08826,0.0,10.81,0.0,0.413,6.417,6.6,5.2873,4.0,305.0,19.2,383.73,6.72
73,23.4,0.19539,0.0,10.81,0.0,0.413,6.245,6.2,5.2873,4.0,305.0,19.2,377.17,7.54
74,24.1,0.07896,0.0,12.83,0.0,0.437,6.273,6.0,4.2515,5.0,398.0,18.7,394.92,6.78
252,29.6,0.08221,22.0,5.86,0.0,0.431,6.957,6.8,8.9067,7.0,330.0,19.1,386.09,3.53

In [ ]:
#if age is < 7, put age = 7

In [174]:
boston.loc[boston["AGE"]<7 , "AGE"] = 7

In [177]:
any(boston.AGE<7)

False

In [185]:
boston[boston['AGE'] < 20]["AGE"] = 20
#not the correct way of assignment, you have to use the loc fn for assignment using boolean indexing

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [187]:
sum(boston.AGE<20)

34

### any and all fn

In [188]:
any(boston.AGE<30)

True

In [189]:
all(boston.AGE<20)

False

In [191]:
sum(boston.AGE < 20)

34

In [ ]:
titanic.su

In [194]:
pd.isnull(titanic).sum() #total number of missing values in the data

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [196]:
titanic.Age.isnull().sum()

177

In [198]:
titanic.Age.median()

28.0

In [199]:
titanic.loc[titanic.Age.isnull(), "Age"] = titanic.Age.median()

In [201]:
any(titanic.Age.isnull())

False

In [210]:
np.logical_or(titanic.Age<10,titanic.Sex=="female")[:3]

Name
Braund, Mr. Owen Harris                                False
Cumings, Mrs. John Bradley (Florence Briggs Thayer)     True
Heikkinen, Miss. Laina                                  True
Name: Age, dtype: bool

In [211]:
titanic.loc[np.logical_and(titanic.Age<4,titanic.Sex=="female"), :]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Laroche, Miss. Simonne Marie Anne Andree",44,True,2,female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
"Andersson, Miss. Ellis Anna Maria",120,False,3,female,2.00,4,2,347082,31.2750,NaN,S
"Johnson, Miss. Eleanor Ileen",173,True,3,female,1.00,1,1,347742,11.1333,NaN,S
"Strom, Miss. Telma Matilda",206,False,3,female,2.00,0,1,347054,10.4625,G6,S
"Allison, Miss. Helen Loraine",298,False,1,female,2.00,1,2,113781,151.5500,C22 C26,S
"Palsson, Miss. Stina Viola",375,False,3,female,3.00,3,1,349909,21.0750,NaN,S
"Nakid, Miss. Maria (""Mary"")",382,True,3,female,1.00,0,2,2653,15.7417,NaN,C
"Baclini, Miss. Helene Barbara",470,True,3,female,0.75,2,1,2666,19.2583,NaN,C
"Hirvonen, Miss. Hildur E",480,True,3,female,2.00,0,1,3101298,12.2875,NaN,S
"Quick, Miss. Phyllis May",531,True,2,female,2.00,1,1,26360,26.0000,NaN,S
"Skoog, Miss. Margit Elizabeth",643,False,3,female,2.00,3,2,347088,27.9000,NaN,S
"Baclini, Miss. Eugenie",645,True,3,female,0.75,2,1,2666,19.2583,NaN,C

#### isin fn

In [214]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [215]:
brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [216]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [225]:
lst_countries = ["India", "USA", "Nepal", "Pakistan", "China", "India", "South Africa", "Netherland"]

In [226]:
for country in lst_countries:
    print(brics.loc[brics["country"]==country,["country","capital"]], end = "\n\n")

  country    capital
2   India  New Delhi

Empty DataFrame
Columns: [country, capital]
Index: []

Empty DataFrame
Columns: [country, capital]
Index: []

Empty DataFrame
Columns: [country, capital]
Index: []

  country  capital
3   China  Beijing

  country    capital
2   India  New Delhi

        country   capital
4  South Africa  Pretoria

Empty DataFrame
Columns: [country, capital]
Index: []

In [227]:
brics.country.isin(lst_countries)
#isin is a pandas series fn. This will check for each value of the series if the value is there in the specified list or not?
#and returns a true/false accordingly

0    False
1    False
2     True
3     True
4     True
Name: country, dtype: bool

In [228]:
brics.country

0          Brazil
1          Russia
2           India
3           China
4    South Africa
Name: country, dtype: object

In [231]:
print(lst_countries)

['India', 'USA', 'Nepal', 'Pakistan', 'China', 'India', 'South Africa', 'Netherland']

In [232]:
"India" in lst_countries

True

In [233]:
#this loop is doing the same thing as isin fn of the pandas series brics.country
for country in brics.country:
    print(country in lst_countries)

False
False
True
True
True

In [235]:
brics.loc[brics.country.isin(lst_countries), ["country", "capital"]]

        country    capital
2         India  New Delhi
3         China    Beijing
4  South Africa   Pretoria

In [238]:
titanic.loc[titanic.Cabin.isin(["C85", "C123"]), titanic.columns.isin(["Survived", "Cabin", "Not_Survived", "FamilySize", "Fare"])]

                                                    Survived     Fare Cabin
Name
Cumings, Mrs. John Bradley (Florence Briggs Tha...      True  71.2833   C85
Futrelle, Mrs. Jacques Heath (Lily May Peel)            True  53.1000  C123
Futrelle, Mr. Jacques Heath                            False  53.1000  C123

----

## Summary functions

In [239]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, Braund, Mr. Owen Harris to Dooley, Mr. Patrick
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null bool
Pclass         891 non-null int64
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null category
dtypes: bool(1), category(1), float64(2), int64(4), object(3)
memory usage: 111.5+ KB

In [240]:
titanic.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    2.308642   29.361582    0.523008    0.381594   32.204208
std     257.353842    0.836071   13.019697    1.102743    0.806057   49.693429
min       1.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    2.000000   22.000000    0.000000    0.000000    7.910400
50%     446.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    3.000000   35.000000    1.000000    0.000000   31.000000
max     891.000000    3.000000   80.000000    8.000000    6.000000  512.329200

1st quartile value or 25%ile value?

This means that if there are 100 passengers in titanic ship, and if we arrange their ages in the increasing order, then 25% of the passengers are having ages smaller than 22

2nd quartile- median value - means 50% of the passengers are having age smaller than 28

3rd quartile - 75%ile - 75% of passengers have age smaller than 35

In [241]:
titanic.describe(include = "all")

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891,891.000000,891,891.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,2,NaN,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,False,NaN,male,NaN,NaN,NaN,1601,NaN,B96 B98,S
freq,NaN,549,NaN,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,NaN,2.308642,NaN,29.361582,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,NaN,0.836071,NaN,13.019697,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,NaN,1.000000,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,NaN,2.000000,NaN,22.000000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,NaN,3.000000,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,NaN,3.000000,NaN,35.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,NaN,3.000000,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

99.9%ile score of X person in cat exam means that 99.9% of the total number of students who appeared for the exam have scored less than this person

std - average deviation from the mean

In [242]:
boston.head()

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,33.4,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,36.2,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33

In [243]:
boston.tail()

,MEDV,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
501,22.4,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67
502,20.6,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08
503,23.9,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64
504,22.0,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48
505,11.9,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88

In [244]:
boston.dtypes

MEDV       float64
CRIM       float64
ZN         float64
INDUS      float64
CHAS       float64
NOX        float64
RM         float64
AGE        float64
DIS        float64
RAD        float64
TAX        float64
PTRATIO    float64
B          float64
LSTAT      float64
dtype: object

----

### Statistical Functions

In [247]:
boston.AGE.mean()

68.58952569169962

In [248]:
boston.AGE.median()

77.5

In [249]:
boston.AGE.std()

28.11611406773052

In [250]:
boston.AGE.quantile(q = .25)

45.025

In [252]:
boston.AGE.min()

7.0

In [253]:
boston.AGE.quantile(.99)

100.0

In [257]:
boston.AGE.notnull()[:2]

0    True
1    True
Name: AGE, dtype: bool

In [260]:
np.percentile(titanic.Fare[titanic.Fare.notnull()], 25)

7.9104

In [265]:
any(titanic_mod[0].Age.isnull())

True

In [268]:
np.percentile(titanic_mod[0].Age[titanic_mod[0].Age.notnull()], 25)

20.125

In [271]:
titanic.mean(axis = 0)

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.361582
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [273]:
boston.quantile(axis =0, q = .25) #axis = 0 for statistical functions means that we want to reduce the rows - i.e col quartile values

MEDV        17.025000
CRIM         0.082045
ZN           0.000000
INDUS        5.190000
CHAS         0.000000
NOX          0.449000
RM           5.885500
AGE         45.025000
DIS          2.100175
RAD          4.000000
TAX        279.000000
PTRATIO     17.400000
B          375.377500
LSTAT        6.950000
Name: 0.25, dtype: float64

In [ ]:
#axis =1 means reduce the columns

In [274]:
from sklearn import datasets

In [275]:
iris = datasets.load_iris()

In [279]:
iris.feature_names

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [280]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [281]:
X = iris.data

In [282]:
y = iris.target

In [287]:
iris_arr=np.concatenate((y.reshape((-1,1)), X), axis = 1)

In [290]:
iris_df = pd.DataFrame(iris_arr, columns=['Species'] + iris.feature_names)

In [291]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [292]:
iris_df.loc[iris_df.Species ==0, "Species"] = iris.target_names[0]

In [293]:
iris_df.loc[iris_df.Species ==1, "Species"] = iris.target_names[1]

In [295]:
iris_df.loc[iris_df.Species ==2, "Species"] = iris.target_names[2]

----

# Class 8

In [1]:
import pandas as pd

In [2]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [3]:
brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [4]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [7]:
import numpy as np

In [15]:
brics[brics.country=="China"].index

Int64Index([3], dtype='int64')

In [9]:
brics.iloc[3,:]

country         China
capital       Beijing
area             9.67
population        133
Name: 3, dtype: object

In [11]:
brics.rename(index = {3: 'Cn'})

         country    capital    area  population
0         Brazil   Brasilia   8.516       200.4
1         Russia     Moscow  17.100       143.5
2          India  New Delhi   3.286      1252.0
Cn         China    Beijing   9.670       133.0
4   South Africa   Pretoria   2.980         4.3

In [16]:
np.where([True, False, True, True, False]) #gives the integer location of the trues

(array([0, 2, 3]),)

In [17]:
#to create a new column
brics['males'] = brics.population/2

In [18]:
brics

        country    capital    area  population   males
0        Brazil   Brasilia   8.516       200.4  100.20
1        Russia     Moscow  17.100       143.5   71.75
2         India  New Delhi   3.286      1252.0  626.00
3         China    Beijing   9.670       133.0   66.50
4  South Africa   Pretoria   2.980         4.3    2.15

In [20]:
row_addn = brics.loc[3]

In [28]:
#to append a row
brics.append(row_addn,ignore_index = True)

         country    capital    area  population   males
0         Brazil   Brasilia   8.516       200.4  100.20
1         Russia     Moscow  17.100       143.5   71.75
2          India  New Delhi   3.286      1252.0  626.00
3          China    Beijing   9.670       133.0   66.50
4   South Africa   Pretoria   2.980         4.3    2.15
5         Brazil   Brasilia   8.516       200.4  100.20
6         Russia     Moscow  17.100       143.5   71.75
7          India  New Delhi   3.286      1252.0  626.00
8          China    Beijing   9.670       133.0   66.50
9   South Africa   Pretoria   2.980         4.3    2.15
10         China    Beijing   9.670       133.0   66.50

In [29]:
#to append a df
brics = brics.append(brics, ignore_index=True)

In [30]:
brics

         country    capital    area  population   males
0         Brazil   Brasilia   8.516       200.4  100.20
1         Russia     Moscow  17.100       143.5   71.75
2          India  New Delhi   3.286      1252.0  626.00
3          China    Beijing   9.670       133.0   66.50
4   South Africa   Pretoria   2.980         4.3    2.15
5         Brazil   Brasilia   8.516       200.4  100.20
6         Russia     Moscow  17.100       143.5   71.75
7          India  New Delhi   3.286      1252.0  626.00
8          China    Beijing   9.670       133.0   66.50
9   South Africa   Pretoria   2.980         4.3    2.15
10        Brazil   Brasilia   8.516       200.4  100.20
11        Russia     Moscow  17.100       143.5   71.75
12         India  New Delhi   3.286      1252.0  626.00
13         China    Beijing   9.670       133.0   66.50
14  South Africa   Pretoria   2.980         4.3    2.15
15        Brazil   Brasilia   8.516       200.4  100.20
16        Russia     Moscow  17.100       143.5   71.75
17         India  New Delhi   3.286      1252.0  626.00
18         China    Beijing   9.670       133.0   66.50
19  South Africa   Pretoria   2.980         4.3    2.15

In [25]:
brics.loc[0]

  country   capital   area  population  males
0  Brazil  Brasilia  8.516       200.4  100.2
0  Brazil  Brasilia  8.516       200.4  100.2

In [26]:
brics.reset_index(drop = True, inplace=True)

In [27]:
brics

        country    capital    area  population   males
0        Brazil   Brasilia   8.516       200.4  100.20
1        Russia     Moscow  17.100       143.5   71.75
2         India  New Delhi   3.286      1252.0  626.00
3         China    Beijing   9.670       133.0   66.50
4  South Africa   Pretoria   2.980         4.3    2.15
5        Brazil   Brasilia   8.516       200.4  100.20
6        Russia     Moscow  17.100       143.5   71.75
7         India  New Delhi   3.286      1252.0  626.00
8         China    Beijing   9.670       133.0   66.50
9  South Africa   Pretoria   2.980         4.3    2.15

---

In [36]:
brics.drop([2,4,5,6,7,8], axis = 0, inplace = True)

In [38]:
brics.drop(["males", "population"], axis = 1, inplace = True)

In [39]:
brics

         country    capital    area
0         Brazil   Brasilia   8.516
1         Russia     Moscow  17.100
3          China    Beijing   9.670
9   South Africa   Pretoria   2.980
10        Brazil   Brasilia   8.516
11        Russia     Moscow  17.100
12         India  New Delhi   3.286
13         China    Beijing   9.670
14  South Africa   Pretoria   2.980
15        Brazil   Brasilia   8.516
16        Russia     Moscow  17.100
17         India  New Delhi   3.286
18         China    Beijing   9.670
19  South Africa   Pretoria   2.980

---

### How to handle categorical columns

In [41]:
titanic = pd.read_csv("titanic_train.csv") #if the file is there in the working dir, then you need not specify the complete path
#But if you want to read the file from a folder outside the directory, then we have to specify the complete path

In [42]:
titanic[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [46]:
pd.value_counts(titanic.Sex, ascending=True, normalize = True)

female    0.352413
male      0.647587
Name: Sex, dtype: float64

In [47]:
titanic.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [48]:
#cross table between 2 categorical variables
pd.crosstab(titanic.Sex, titanic.Embarked)

Embarked   C   Q    S
Sex
female    73  36  203
male      95  41  441

In [50]:
titanic.groupby(titanic.Sex).mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [53]:
titanic.groupby(titanic.Embarked).median()[["Survived", "Age", "Fare"]]

          Survived   Age   Fare
Embarked
C              1.0  29.0  29.70
Q              0.0  27.0   7.75
S              0.0  28.0  13.00

In [58]:
titanic.groupby(titanic.Embarked).count() #frequency count according to Embarked

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
Embarked,,,,,,,,,,,
C,168,168,168,168,168,130,168,168,168,168,69
Q,77,77,77,77,77,28,77,77,77,77,4
S,644,644,644,644,644,554,644,644,644,644,129

In [60]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [61]:
aggregation = [np.mean, np.median, np.min, np.max]

In [62]:
titanic.groupby("Sex")["Age"].agg(aggregation)

             mean  median  amin  amax
Sex
female  27.915709    27.0  0.75  63.0
male    30.726645    29.0  0.42  80.0

In [151]:
titanic.groupby(by = ["Sex", "Embarked"]).count()[["PassengerId"]].unstack()

         PassengerId
Embarked           C   Q    S
Sex
female            73  36  203
male              95  41  441

In [68]:
titanic.groupby("Survived").count()[["PassengerId"]]

          PassengerId
Survived
0                 549
1                 342

In [71]:
def data_range(ser):
    return ser.max() - ser.min()

In [78]:
data_range(titanic.Age)

79.58

In [80]:
titanic.Age.max() - titanic.Age.min()

79.58

In [75]:
aggregation = {
               "Age": [np.mean, np.median, data_range],
              "Fare": [np.mean], 
              }

In [ ]:
titanic.groupby("Survived").agg(aggregation)

In [81]:
aggregation = {
               "Age": {"Mean_Age": np.mean, "Median_Age": np.median, "Range_Age": data_range},
              "Fare": {"Average_Fare": np.mean}, 
              }

In [82]:
titanic.groupby("Survived").agg(aggregation)

/opt/anaconda3/lib/python3.7/site-packages/pandas/core/groupby/generic.py:1315: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

                Age                              Fare
           Mean_Age Median_Age Range_Age Average_Fare
Survived
0         30.626179       28.0     73.00    22.117887
1         28.343690       28.0     79.58    48.395408

---

### Pivot_table command

In [85]:
pd.pivot_table(titanic, index = "Sex", values = ["Age", "Fare", "Survived"], aggfunc=np.median)

         Age  Fare  Survived
Sex
female  27.0  23.0         1
male    29.0  10.5         0

pd.pivot_table(data = titanic, index = <cat var>, columns = <cat var>, values - the variables for which the aggregation is being sought,  aggfunc = aggregation functions like mean, median, sum, len)

In [93]:
pd.pivot_table(titanic, index = "Sex", columns="Embarked", aggfunc= [np.mean, np.median, len] )

               mean                                                         \
                Age                             Fare
Embarked          C          Q          S          C          Q          S
Sex
female    28.344262  24.291667  27.771505  75.169805  12.634958  38.740929
male      32.998841  30.937500  30.291440  48.262109  13.838922  21.711996

                                                    ...    len                 \
             Parch                     PassengerId  ... Pclass SibSp
Embarked         C         Q         S           C  ...      S     C   Q    S
Sex                                                 ...
female    0.493151  0.222222  0.788177  437.315068  ...    203    73  36  203
male      0.263158  0.121951  0.240363  451.536842  ...    441    95  41  441


         Survived          Ticket
Embarked        C   Q    S      C   Q    S
Sex
female         73  36  203     73  36  203
male           95  41  441     95  41  441

[2 rows x 72 columns]

In [99]:
pd.set_option('display.precision', 2)

In [100]:
pd.pivot_table(titanic, index = ["Sex"], columns=["Survived"], margins = True)

            Age                 Fare               Parch              \
Survived      0      1    All      0      1    All     0     1   All
Sex
female    25.05  28.85  32.68  23.02  51.94  89.00  1.04  0.52  0.55
male      31.62  27.28  38.45  21.96  40.82  69.12  0.21  0.36  0.41
All       41.35  32.91  35.67  64.05  85.82  78.68  0.45  0.49  0.48

         PassengerId                 Pclass             SibSp
Survived           0       1     All      0     1   All     0     1   All
Sex
female        434.85  429.70  461.82   2.85  1.92  1.22  1.21  0.52  0.53
male          449.12  475.72  449.39   2.48  2.02  1.17  0.44  0.39  0.40
All           402.98  480.92  455.37   1.22  1.18  1.19  0.37  0.51  0.46

In [ ]:
#index and columns - the var acc to which the aggregation is being sought
#values - the numeric var for which you are seeking the aggregation. If you don't specify the values then aggregation for all the numerical vars will be retreived.

In [98]:
pd.pivot_table(titanic, index = ["Sex"], columns=["Survived"], values= "Age", margins = True, aggfunc=np.median)

Survived     0     1   All
Sex
female    24.5  28.0  27.0
male      29.0  28.0  29.0
All       28.0  28.0  28.0

----

### How to set the print options for numpy arrays and for pandas df

In [113]:
arr = np.array([34.905, 89.910467, 9.6735, 0.0006])

In [114]:
arr

array([34.91, 89.91,  9.67,  0.  ])

In [125]:
np.set_printoptions(precision=2, suppress=True)
#suppress = False will print in the scientific notation
#suprress = True will print the fixed notation
#precision - for the decimal places

In [121]:
arr

array([34.91, 89.91,  9.67,  0.  ])

In [126]:
#?pd.set_option

In [127]:
pd.set_option("display.precision", 3)

In [128]:
titanic.groupby("Sex").mean()

        PassengerId  Survived  Pclass     Age  SibSp  Parch    Fare
Sex
female      431.029     0.742   2.159  27.916  0.694  0.650  44.480
male        454.147     0.189   2.390  30.727  0.430  0.236  25.524

---

### Inner and outer joins

In [138]:
left= {'id': range(1,6),
       'Name': ['A',"B","C","D", "E"],
       'Subject': ["Sub1", "Sub2", "Sub3", "Sub4", "Sub5"]}

In [139]:
right = {'id': range(2,11,2),
        'Height': [120,110,115,130,140],
        'Weight': [30,35, 40,45, 40]}

In [140]:
A = pd.DataFrame(left)

In [141]:
B = pd.DataFrame(right)

In [142]:
A

   id Name Subject
0   1    A    Sub1
1   2    B    Sub2
2   3    C    Sub3
3   4    D    Sub4
4   5    E    Sub5

In [143]:
B

   id  Height  Weight
0   2     120      30
1   4     110      35
2   6     115      40
3   8     130      45
4  10     140      40

In [144]:
inner_join_df = pd.merge(left=A, right = B, how='inner', on = 'id')

In [145]:
inner_join_df

   id Name Subject  Height  Weight
0   2    B    Sub2     120      30
1   4    D    Sub4     110      35

In [149]:
pd.merge(left = A, right=B, how='outer', left_on='id', right_on='id')
#how - inner, left, right, outer - inner is default

   id Name Subject  Height  Weight
0   1    A    Sub1     NaN     NaN
1   2    B    Sub2   120.0    30.0
2   3    C    Sub3     NaN     NaN
3   4    D    Sub4   110.0    35.0
4   5    E    Sub5     NaN     NaN
5   6  NaN     NaN   115.0    40.0
6   8  NaN     NaN   130.0    45.0
7  10  NaN     NaN   140.0    40.0

----

# Class 9

In [77]:
titanic = pd.read_csv("titanic_train.csv") #if the file is there in the working dir, then you need not specify the complete path
#But if you want to read the file from a folder outside the directory, then we have to specify the complete path

In [78]:
titanic[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### Apply map replace

apply - to apply some fun on each component of a series

In [22]:
brics["Country_Length"]=brics.country.apply(len)

In [23]:
brics

        country    capital    area  population  Country_Length
1        Brazil   Brasilia   8.516       200.4               6
3        Russia     Moscow  17.100       143.5               6
5         India  New Delhi   3.286      1252.0               5
7         China    Beijing   9.670       133.0               5
9  South Africa   Pretoria   2.980         4.3              12

In [26]:
import numpy as np
brics["Log_Population"]=brics.population.apply(np.log)

In [42]:
def add_custom_values(x, *args, **kwargs):
    """
    x: each component of the series
    *args: any number of argument (non mandatory)
    **kwargs: means those arguments will be in the dictionary key value pair format
    """
    for key in kwargs:
  #      print(key, ":", kwargs[key])
        x+=kwargs[key]
    return x

In [43]:
add_custom_values(x = 5, a = 2, b = 3, c = 5, d = 7, e = 9)

31

In [45]:
print(list(brics.Country_Length))

[6, 6, 5, 5, 12]

In [44]:
brics['Country_Length'].apply(add_custom_values, a = 2, b = 3, c = 4)

1    15
3    15
5    14
7    14
9    21
Name: Country_Length, dtype: int64

In [46]:
brics.population.apply(lambda x: x**.5)

1    14.156271
3    11.979149
5    35.383612
7    11.532563
9     2.073644
Name: population, dtype: float64

### Map function

In [47]:
brics

        country    capital    area  population  Country_Length  Log_Population
1        Brazil   Brasilia   8.516       200.4               6        5.300315
3        Russia     Moscow  17.100       143.5               6        4.966335
5         India  New Delhi   3.286      1252.0               5        7.132498
7         China    Beijing   9.670       133.0               5        4.890349
9  South Africa   Pretoria   2.980         4.3              12        1.458615

In [48]:
brics["length_using_map"] = brics.capital.map(len)

In [49]:
brics

,country,capital,area,population,Country_Length,Log_Population,length_using_map
1,Brazil,Brasilia,8.516,200.4,6,5.300315,8
3,Russia,Moscow,17.100,143.5,6,4.966335,6
5,India,New Delhi,3.286,1252.0,5,7.132498,9
7,China,Beijing,9.670,133.0,5,4.890349,7
9,South Africa,Pretoria,2.980,4.3,12,1.458615,8

In [50]:
brics.population.map(lambda x: x**.5)

1    14.156271
3    11.979149
5    35.383612
7    11.532563
9     2.073644
Name: population, dtype: float64

In [51]:
brics.Country_Length.map(add_custom_values, a = 2, b= 3)

TypeError: map() got an unexpected keyword argument 'a'

In [54]:
titanic["Gender"]=titanic.Sex.map({"male": 0, "female":1})

In [63]:
titanic.Embarked.map({"S": 0, "C": 1}) #whereever embarked = Q, we got NaN
#we have to make sure that all the levels in the categorical col are specified in the map fn

0      0.0
1      1.0
2      0.0
3      0.0
4      0.0
5      NaN
6      0.0
7      0.0
8      0.0
9      1.0
10     0.0
11     0.0
12     0.0
13     0.0
14     0.0
15     0.0
16     NaN
17     0.0
18     0.0
19     1.0
20     0.0
21     0.0
22     NaN
23     0.0
24     0.0
25     0.0
26     1.0
27     0.0
28     NaN
29     0.0
      ...
861    0.0
862    0.0
863    0.0
864    0.0
865    0.0
866    1.0
867    0.0
868    0.0
869    0.0
870    0.0
871    0.0
872    0.0
873    0.0
874    1.0
875    1.0
876    0.0
877    0.0
878    0.0
879    1.0
880    0.0
881    0.0
882    0.0
883    0.0
884    0.0
885    NaN
886    0.0
887    0.0
888    0.0
889    1.0
890    NaN
Name: Embarked, Length: 891, dtype: float64

### replace fun

In [61]:
titanic["Embarked"].replace({"S": 0, "C": 1})[:10] #not getting null values in place of Q, rather Q is unchanged

0    0
1    1
2    0
3    0
4    0
5    Q
6    0
7    0
8    0
9    1
Name: Embarked, dtype: object

### String columns

In [ ]:
"".

In [81]:
titanic = pd.read_csv("titanic_train.csv") #if the file is there in the working dir, then you need not specify the complete path
#But if you want to read the file from a folder outside the directory, then we have to specify the complete path

In [82]:
titanic[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [91]:
titanic["title"] = titanic.Name.str.split().str.get(1).str.capitalize()

In [108]:
df2 = titanic.loc[:,  ["title"]]

In [109]:
df1 = titanic.loc[:, "PassengerId": "Name"]

In [110]:
df3 = titanic.loc[:,"Sex": "Embarked"]

In [114]:
titanic = pd.concat(objs=(df1,df2,df3), axis = 1)

### Regular expressions on the string columns

In [115]:
data = {'raw': ['Arizona 1 2014-12-23       3242.0',
                'Iowa 1 2010-02-23       3453.7',
                'Oregon 0 2014-06-20       2123.0',
                'Maryland 0 2014-03-14       1123.6',
                'Florida 1 2013-01-15       2134.0',
                'Georgia 0 2012-07-14       2345.6']}
df = pd.DataFrame(data, columns = ['raw'])
df

                                  raw
0   Arizona 1 2014-12-23       3242.0
1      Iowa 1 2010-02-23       3453.7
2    Oregon 0 2014-06-20       2123.0
3  Maryland 0 2014-03-14       1123.6
4   Florida 1 2013-01-15       2134.0
5   Georgia 0 2012-07-14       2345.6

In [122]:
df["Gender"]=df.raw.str.extract('(\d)')

In [127]:
df["Date"] = df.raw.str.extract('(....-..-..)')

In [131]:
df["Score"]=df.raw.str.extract("(....\..)")

In [135]:
df["State"]=df.raw.str.extract("([A-Z]\w+)")

In [136]:
df

                                  raw Gender        Date   Score     State
0   Arizona 1 2014-12-23       3242.0      1  2014-12-23  3242.0   Arizona
1      Iowa 1 2010-02-23       3453.7      1  2010-02-23  3453.7      Iowa
2    Oregon 0 2014-06-20       2123.0      0  2014-06-20  2123.0    Oregon
3  Maryland 0 2014-03-14       1123.6      0  2014-03-14  1123.6  Maryland
4   Florida 1 2013-01-15       2134.0      1  2013-01-15  2134.0   Florida
5   Georgia 0 2012-07-14       2345.6      0  2012-07-14  2345.6   Georgia

In [140]:
titanic.Name.apply(lambda x: x.split()).apply(lambda x: x[1].lower())

0             mr.
1            mrs.
2           miss.
3            mrs.
4             mr.
5             mr.
6             mr.
7         master.
8            mrs.
9            mrs.
10          miss.
11          miss.
12            mr.
13            mr.
14          miss.
15           mrs.
16        master.
17            mr.
18        planke,
19           mrs.
20            mr.
21            mr.
22          miss.
23            mr.
24          miss.
25           mrs.
26            mr.
27            mr.
28          miss.
29            mr.
          ...
861           mr.
862          mrs.
863         miss.
864           mr.
865          mrs.
866             y
867           mr.
868    melkebeke,
869       master.
870           mr.
871          mrs.
872           mr.
873     cruyssen,
874          mrs.
875         miss.
876           mr.
877           mr.
878           mr.
879          mrs.
880          mrs.
881           mr.
882         miss.
883           mr.
884           mr.
885          mrs.
886          rev.
887         miss.
888         miss.
889           mr.
890           mr.
Name: Name, Length: 891, dtype: object